index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>xzpeter's hub</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-06-19 12:35:46 CST"/>
<meta name="author" content="xzpeter"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">xzpeter's hub</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">About this site </h2>
<div class="outline-text-2" id="text-1">


<p>
This is the github homepage for me. <a href="http://xzpeter.org">Here</a> is my Chinese blog which you may come and see over. This site is a little bit different from the chinese blog: 
</p>
<ol>
<li>It's hosted on github so that <b>it is totally free</b> :)
</li>
<li>It will be all written in <b>english</b> .
</li>
<li>The topic may be very small stuffs, like some <i>HOWTO</i> tips on using Linux, or so on. So more like a NOTE page here. 
</li>
<li>Totally <b>plain text</b> here.
</li>
<li>I can commit my blog with the help of <b>git</b> . So it is fast. (that one, I use <a href="https://github.com/punchagan/org2blog">org2blog</a>, which is also fast :) )
</li>
</ol>


<p>   
Hope you enjoy. 
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">About me </h2>
<div class="outline-text-2" id="text-2">


<p>
You may check <a href="http://xzpeter.org/?page_id=355
">here</a> if you want to know who am I. 
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Topics </h2>
<div class="outline-text-2" id="text-3">


<p>
Here is a list of the topics. 
</p>
<p>
<a href="linux-mint-13-howto.html">Linux Mint 13 HOWTOs</a>
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Ends Here&hellip; </h2>
<div class="outline-text-2" id="text-4">

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-06-19 12:35:46 CST</p>
<p class="author">Author: xzpeter</p>
<p class="creator">Org version 7.7 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
